# configure taps
tap "homebrew/cask"
tap "homebrew/services"
tap "caskroom/versions"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"


# Install formulae
brew "aria2"
brew "bash"
brew "colordiff"
brew "findutils"
brew "fish"
brew "git"
brew "git-flow-avh"
brew "graphicsmagick"
brew "graphviz"
brew "grep"
brew "python"
brew "httpie"
brew "iproute2mac"
brew "nmap"
brew "node"
brew "mas"
brew "pipenv"
brew "python@2"
brew "ruby"
brew "slackcat"
brew "terraform"
brew "thefuck"
brew "z"

# install casks
cask "atom"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-hack"
cask "freedome"
cask "gimp"
cask "google-chrome"
cask "iterm2"
cask "java"
cask "keepingyouawake"
cask "moom"
cask "pycharm-ce"
cask "rocket"
cask "skype-for-business"
cask "slack"
cask "spotify"
cask "spotify-notifications"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"

# default OSX apps
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

# Our own AppStore apps
mas "LastPass", id: 926036361
mas "Microsoft Remote Desktop", id: 1295203466
mas "The Unarchiver", id: 425424353